blog/10.org
#+options: html-link-use-abs-url:nil html-postamble:t
#+options: html-preamble:t html-scripts:nil html-style:t
#+options: html5-fancy:nil tex:t toc:nil num:nil
#+html_doctype: xhtml-strict
#+html_container: div
#+html_content_class: content
#+description:
#+keywords:
#+html_link_home:
#+html_link_up:
#+html_mathjax:
#+html_equation_reference_format: \eqref{%s}
#+html_head: <link rel="stylesheet" type="text/css" href="./style.css"/>
#+html_head_extra:
#+title: SICP. 1.3.2--1.3.4
#+subtitle: 2023-02-15 Wed
#+infojs_opt:
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)
#+latex_header:

* 1.3.2 Constructing Procedures Using ~Lambda~
The mystical λ seen on the cover comes on stage. Procedures can be
created without giving them a name:

#+begin_src scheme
  (lambda (x) (+ x 4)) ;; a procedure that adds 4 to its argument
#+end_src

This allows us, for example, to define ~integral~ in this way:
#+begin_src scheme
  (define (integral f a b dx)
    (* (sum f (+ a (/ dx 2.0))
            (lambda (x) (+ x dx))
            b)
       dx))
#+end_src

instead of doing it in this way:
#+begin_src scheme
  (define (integral f a b dx)
    (define (add-dx x) (+ x dx))
    (* (sum f (+ a (/ dx 2.0)) add-dx b)
       dx))
#+end_src

Notice that saying
#+begin_src scheme
  (define (plus4 x) (+ x 4))
#+end_src

is equivalent to say
#+begin_src scheme
  (define plus4 (lambda (x) (+ x 4)))
#+end_src

~Lambda~ can be used to bind local variables:
#+begin_src scheme
  (define (f x y)
    ((lambda (a b)
       (+ (* x (square a))
          (* y b)
          (* a b)))
     (+ 1 (* x y))
     (- 1 y)))
#+end_src

This is so useful that Scheme provides a special form, ~let~, for
achieving the same result:

#+begin_src scheme
  (define (f x y)
    (let ((a (+ 1 (* x y)))
          (b (- 1 y)))
      (+ (* x (square a))
         (* y b)
         (* a b))))
#+end_src

~Let~ is nothing more than syntactic sugar.

* Exercise 1.34
*Exercise*:

#+begin_quote
Suppose we define the procedure

#+begin_src scheme
  (define (f g) (g 2))
#+end_src

Then we have

#+begin_src scheme
  (f square)
  4

  (f (lambda (z) (* z (+ z 1))))
  6
#+end_src

What happens if we (perversely) ask the interpreter to evaluate the
combination (f f)? Explain?
#+end_quote

*Answer*:

According to the substitution model:
#+begin_src
(f f)
(f 2)
(2 2)
#+end_src

In `(2 2)`, `2` is used as if it denoted a procedure. But `2` does
not denote a procedure. `2` denotes a number. So, I predict that the
interpreter will complain about this.

In fact, when trying to evaluate the combination, DrRacket says:
#+begin_quote
application: not a procedures;
expected a procedures that can be applied to arguments
given: 2
#+end_quote

* 1.3.3 Procedures as General Methods
The authors discuss here two examples of how ~lambda~ can be used (to
write ``procedures used express general methods of computation,
independent of the particular functions involved''.).

The exercises are a bit mathematically heavy. I'm skipping them.
* 1.3.4 Procedures as Returned Values
Procedures can not only take procedures as their arguments, but also
return procedures...
