blog/10.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-15 Wed 23:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SICP. 1.3.2&#x2013;1.3.4</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">SICP. 1.3.2&#x2013;1.3.4
<br />
<span class="subtitle">2023-02-15 Wed</span>
</h1>

<div id="outline-container-org5fb7850" class="outline-2">
<h2 id="org5fb7850">1.3.2 Constructing Procedures Using <code>Lambda</code></h2>
<div class="outline-text-2" id="text-org5fb7850">
<p>
The mystical λ seen on the cover comes on stage. Procedures can be
created without giving them a name:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">lambda</span> (x) (+ x 4)) <span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">a procedure that adds 4 to its argument</span>
</pre>
</div>

<p>
This allows us, for example, to define <code>integral</code> in this way:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">integral</span> f a b dx)
  (* (sum f (+ a (/ dx 2.0))
          (<span style="color: #b9ca4a;">lambda</span> (x) (+ x dx))
          b)
     dx))
</pre>
</div>

<p>
instead of doing it in this way:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">integral</span> f a b dx)
  (<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">add-dx</span> x) (+ x dx))
  (* (sum f (+ a (/ dx 2.0)) add-dx b)
     dx))
</pre>
</div>

<p>
Notice that saying
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">plus4</span> x) (+ x 4))
</pre>
</div>

<p>
is equivalent to say
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> <span style="color: #e78c45;">plus4</span> (<span style="color: #b9ca4a;">lambda</span> (x) (+ x 4)))
</pre>
</div>

<p>
<code>Lambda</code> can be used to bind local variables:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">f</span> x y)
  ((<span style="color: #b9ca4a;">lambda</span> (a b)
     (+ (* x (square a))
        (* y b)
        (* a b)))
   (+ 1 (* x y))
   (- 1 y)))
</pre>
</div>

<p>
This is so useful that Scheme provides a special form, <code>let</code>, for
achieving the same result:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">f</span> x y)
  (<span style="color: #b9ca4a;">let</span> ((a (+ 1 (* x y)))
        (b (- 1 y)))
    (+ (* x (square a))
       (* y b)
       (* a b))))
</pre>
</div>

<p>
<code>Let</code> is nothing more than syntactic sugar.
</p>
</div>
</div>

<div id="outline-container-org540cb88" class="outline-2">
<h2 id="org540cb88">Exercise 1.34</h2>
<div class="outline-text-2" id="text-org540cb88">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Suppose we define the procedure
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">f</span> g) (g 2))
</pre>
</div>

<p>
Then we have
</p>

<div class="org-src-container">
<pre class="src src-scheme">(f square)
4

(f (<span style="color: #b9ca4a;">lambda</span> (z) (* z (+ z 1))))
6
</pre>
</div>

<p>
What happens if we (perversely) ask the interpreter to evaluate the
combination (f f)? Explain?
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
According to the substitution model:
</p>
<pre class="example">
(f f)
(f 2)
(2 2)
</pre>

<p>
In `(2 2)`, `2` is used as if it denoted a procedure. But `2` does
not denote a procedure. `2` denotes a number. So, I predict that the
interpreter will complain about this.
</p>

<p>
In fact, when trying to evaluate the combination, DrRacket says:
</p>
<blockquote>
<p>
application: not a procedures;
expected a procedures that can be applied to arguments
given: 2
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org3137957" class="outline-2">
<h2 id="org3137957">1.3.3 Procedures as General Methods</h2>
<div class="outline-text-2" id="text-org3137957">
<p>
The authors discuss here two examples of how <code>lambda</code> can be used (to
write ``procedures used express general methods of computation,
independent of the particular functions involved''.).
</p>

<p>
The exercises are a bit mathematically heavy. I'm skipping them.
</p>
</div>
</div>
<div id="outline-container-orgddc5d47" class="outline-2">
<h2 id="orgddc5d47">1.3.4 Procedures as Returned Values</h2>
<div class="outline-text-2" id="text-orgddc5d47">
<p>
Procedures can not only take procedures as their arguments, but also
return procedures&#x2026;
</p>
</div>
</div>
