blog/10.html
<div id="outline-container-org64da205" class="outline-2">
<h2 id="org64da205">Exercise 1.41</h2>
<div class="outline-text-2" id="text-org64da205">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Define a procedure double that takes a procedure of one argument as
argument and returns a procedure that applies the original procedure
twice. For example, if <code>inc</code> is a procedure that adds 1 to its
argument, then <code>(double inc)</code> should be a procedure that adds 2. What
value is returned by
</p>

<div class="org-src-container">
<pre class="src src-scheme">(((double (double double)) inc) 5)
</pre>
</div>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">(((double (double double)) inc) 5)</span>

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">(double inc) =&gt; (lambda (x) (inc (inc x)))</span>

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">(double double) =&gt; (lambda (x) (double (double x)))</span>

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">(double (double double)) =&gt;</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">(lambda (x) ((lambda (x) (double (double x)))</span>
<span style="color: #969896; font-style: italic;">;;             </span><span style="color: #969896; font-style: italic;">((lambda (x) (double (double x))) x)))</span>

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">so:</span>

((double (double double) inc))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x) (double (double x)))
 (double (double inc)))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x) (double (double x)))
 (double (<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x) (double (double x)))
 (<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
              ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x))))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

(double (double (<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                             ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

(double (<span style="color: #b9ca4a;">lambda</span> (x)
          ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                        ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
           ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                         ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x))) x))))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

(<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x)
               ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                             ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
                ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                              ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x))) x)))
             ((<span style="color: #b9ca4a;">lambda</span> (x)
                ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                              ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
                 ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                               ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x))) x)))
              x)))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">now let's apply that lambda to 5:</span>
((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x)
                ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                              ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
                 ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                               ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x))) x)))
              ((<span style="color: #b9ca4a;">lambda</span> (x)
                 ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                               ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
                  ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                                ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x))) x)))
               x))) 5)

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x)
   ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                 ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
    ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                  ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x))) x)))
 ((<span style="color: #b9ca4a;">lambda</span> (x)
    ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                  ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
     ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                   ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x))) x)))
  5))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x)
   ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                 ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
    ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                  ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x))) x)))
 ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
               ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
  ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x))) 5)))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x)
   ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                 ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
    ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                  ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x))) x)))
 ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
               ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
  ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
   ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) 5))))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x)
   ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                 ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
    ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                  ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x))) x)))
 ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
               ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
  ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
   (inc (inc 5)))))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x)
   ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                 ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
    ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                  ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x))) x)))
 ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
               ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
  ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
   (inc 6))))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x)
   ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                 ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
    ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                  ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x))) x)))
 ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
               ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
  ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
   7)))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x)
   ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                 ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
    ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                  ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x))) x)))
 ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
               ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
  (inc (inc 7))))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x)
   ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                 ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
    ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                  ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x))) x)))
 ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
               ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
  (inc 8)))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x)
   ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                 ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
    ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                  ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x))) x)))
 ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
               ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
  9))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x)
   ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                 ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
    ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                  ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x))) x)))
 ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
  ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) 9)))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x)
   ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                 ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
    ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                  ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x))) x)))
 ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
  (inc (inc 9))))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x)
   ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                 ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
    ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                  ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x))) x)))
 ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
  (inc 10)))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x)
   ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                 ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
    ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                  ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x))) x)))
 ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
  11))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x)
   ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                 ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
    ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                  ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x))) x)))
 (inc (inc 11)))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x)
   ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                 ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
    ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                  ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x))) x)))
 (inc 12))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x)
   ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                 ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
    ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
                  ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x))) x)))
 13)

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
              ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
 ((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
               ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x))) 13))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
              ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
 ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
  ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) 13)))


<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>
((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
              ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
 ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
  (inc (inc 13))))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
              ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
 ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
  (inc 14)))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
              ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
 ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
  15))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
              ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
 (inc (inc 15)))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
              ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
 (inc 16))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x) ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
              ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) x)))
 17)

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
 ((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x))) 17))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
 (inc (inc 17)))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
 (inc 18))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

((<span style="color: #b9ca4a;">lambda</span> (x) (inc (inc x)))
 19)

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

(inc (inc 19))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

(inc 20)

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt;</span>

21

</pre>
</div>
</div>
</div>
