blog/10.org
* Exercise 1.42
*Exercise*:

#+begin_quote
Let $f$ and $g$ be two one-argument functions. The /composition/ $f$
after $g$ is defined to be the function $x \mapsto f(g(x))$. Define a
procedure ~compose~ that implements composition. For example, if ~inc~
is a procedure that adds 1 to its argument,

#+begin_src scheme
  ((compose square inc) 6)
  49
#+end_src
#+end_quote

*Answer*:

#+begin_src scheme
  (define (compose f1 f2)
    (lambda (x) (f1 (f2 x))))
#+end_src

* Exercise 1.43
*Exercise*:

#+begin_quote
If $f$ is a numerical function and $n$ is a positive integer, then we
can form the $n^{th}$ repeated application of $f$, which is defined to
be the function whose value at $x$ is $f(f(…(f(x))…))$. For example,
if $f$ is the function $x \mapsto x+1$, then the $n^{th}$ repeated
application of $f$ is the function $x \mapsto x+n$. If $f$ is the
operation of squaring a number, then the $n^{th}$ repeated application
of $f$ is the function that raises its argument to the $2^{n}$ -th
power. Write a procedure that takes as inputs a procedure that
computes $f$ and a positive integer $n$ and returns the procedure that
computes the $n^{th}$ repeated application of $f$. Your procedure
should be able to be used as follows:

#+begin_src scheme
((repeated square 2) 5)
625
#+end_src

Hint: You may find it convenient to use ~compose~ from Exercise 1.42.
#+end_quote

*Answer*:

#+begin_src scheme
  (define (repeated f n)
    (cond ((= x 1) f)
          ((= x 2) (compose f f))
          (else (compose f (repeated f (- n 1))))))
#+end_src

* Exercise 1.44
*Exercise*:

#+begin_quote
The idea of /smoothing/ a function is an important concept in signal
processing. If $f$ is a function and $dx$ is some small number, then
the smoothed version of $f$ is the function whose value at a point $x$
is the average of $f(x−dx)$, $f(x)$, and $f(x+dx)$. Write a procedure
$smooth$ that takes as input a procedure that computes $f$ and returns
a procedure that computes the smoothed $f$. It is sometimes valuable
to repeatedly smooth a function (that is, smooth the smoothed
function, and so on) to obtain the $n-fold smoothed function$. Show
how to generate the $n-fold$ smoothed function of any given function
using ~smooth~ and ~repeated~ from Exercise 1.43.
#+end_quote

*Answer*:

#+begin_src scheme
  (define (smooth f)
    (lambda (x)
      (/ 3
         (+ (f (- x 0.01))
            (f x)
            (f (+ x 0.01))))))

  (define (10th-smoothed-f f)
    ((repeated smooth 10) f))
#+end_src

* Exercise 1.46
*Exercise*:

#+begin_quote
Several of the numerical methods described in this chapter are
instances of an extremely general computational strategy known as
/iterative improvement/. Iterative improvement says that, to compute
something, we start with an initial guess for the answer, test if the
guess is good enough, and otherwise improve the guess and continue the
process using the improved guess as the new guess. Write a procedure
~iterative-improve~ that takes two procedures as arguments: a method
for telling whether a guess is good enough and a method for improving
a guess. ~Iterative-improve~ should return as its value a procedure that
takes a guess as argument and keeps improving the guess until it is
good enough. Rewrite the sqrt procedure of 1.1.7 and the fixed-point
procedure of 1.3.3 in terms of iterative-improve.
#+end_quote

*Answer*:

#+begin_src scheme
  (define (iterative-improve good-enough? improve)
    (define (iterative-improve-inner guess)
      (if (good-enough? guess) guess
          (iterative-improve-inner (improve guess))))
    (lambda (x) (iterative-improve-inner x)))
#+end_src

#+begin_src scheme
  (define (sqrt x)
    ((iterative-improve (lambda (guess)
                          (< (abs (- (square guess) x)) 0.001))
                        (lambda (guess)
                          (average guess (/ x guess))))
     1.0))
#+end_src

#+begin_export html
<div style="text-align: center;">
<a href="./posts.html">←</a>
</div>
#+end_export
