blog/10.html
<div id="outline-container-orgba53506" class="outline-2">
<h2 id="orgba53506">Exercise 1.42</h2>
<div class="outline-text-2" id="text-orgba53506">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Let \(f\) and \(g\) be two one-argument functions. The <i>composition</i> \(f\)
after \(g\) is defined to be the function \(x \mapsto f(g(x))\). Define a
procedure <code>compose</code> that implements composition. For example, if <code>inc</code>
is a procedure that adds 1 to its argument,
</p>

<div class="org-src-container">
<pre class="src src-scheme">((compose square inc) 6)
49
</pre>
</div>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">compose</span> f1 f2)
  (<span style="color: #b9ca4a;">lambda</span> (x) (f1 (f2 x))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org2e864ce" class="outline-2">
<h2 id="org2e864ce">Exercise 1.43</h2>
<div class="outline-text-2" id="text-org2e864ce">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
If \(f\) is a numerical function and \(n\) is a positive integer, then we
can form the \(n^{th}\) repeated application of \(f\), which is defined to
be the function whose value at \(x\) is \(f(f(…(f(x))…))\). For example,
if \(f\) is the function \(x \mapsto x+1\), then the \(n^{th}\) repeated
application of \(f\) is the function \(x \mapsto x+n\). If \(f\) is the
operation of squaring a number, then the \(n^{th}\) repeated application
of \(f\) is the function that raises its argument to the \(2^{n}\) -th
power. Write a procedure that takes as inputs a procedure that
computes \(f\) and a positive integer \(n\) and returns the procedure that
computes the \(n^{th}\) repeated application of \(f\). Your procedure
should be able to be used as follows:
</p>

<div class="org-src-container">
<pre class="src src-scheme">((repeated square 2) 5)
625
</pre>
</div>

<p>
Hint: You may find it convenient to use <code>compose</code> from Exercise 1.42.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">repeated</span> f n)
  (<span style="color: #b9ca4a;">cond</span> ((= x 1) f)
        ((= x 2) (compose f f))
        (<span style="color: #b9ca4a;">else</span> (compose f (repeated f (- n 1))))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org076b87d" class="outline-2">
<h2 id="org076b87d">Exercise 1.44</h2>
<div class="outline-text-2" id="text-org076b87d">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
The idea of <i>smoothing</i> a function is an important concept in signal
processing. If \(f\) is a function and \(dx\) is some small number, then
the smoothed version of \(f\) is the function whose value at a point \(x\)
is the average of \(f(x−dx)\), \(f(x)\), and \(f(x+dx)\). Write a procedure
\(smooth\) that takes as input a procedure that computes \(f\) and returns
a procedure that computes the smoothed \(f\). It is sometimes valuable
to repeatedly smooth a function (that is, smooth the smoothed
function, and so on) to obtain the \(n-fold smoothed function\). Show
how to generate the \(n-fold\) smoothed function of any given function
using <code>smooth</code> and <code>repeated</code> from Exercise 1.43.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">smooth</span> f)
  (<span style="color: #b9ca4a;">lambda</span> (x)
    (/ 3
       (+ (f (- x 0.01))
          (f x)
          (f (+ x 0.01))))))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">10th-smoothed-f</span> f)
  ((repeated smooth 10) f))
</pre>
</div>
</div>
</div>

<div id="outline-container-org81462c8" class="outline-2">
<h2 id="org81462c8">Exercise 1.46</h2>
<div class="outline-text-2" id="text-org81462c8">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Several of the numerical methods described in this chapter are
instances of an extremely general computational strategy known as
<i>iterative improvement</i>. Iterative improvement says that, to compute
something, we start with an initial guess for the answer, test if the
guess is good enough, and otherwise improve the guess and continue the
process using the improved guess as the new guess. Write a procedure
<code>iterative-improve</code> that takes two procedures as arguments: a method
for telling whether a guess is good enough and a method for improving
a guess. <code>Iterative-improve</code> should return as its value a procedure that
takes a guess as argument and keeps improving the guess until it is
good enough. Rewrite the sqrt procedure of 1.1.7 and the fixed-point
procedure of 1.3.3 in terms of iterative-improve.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">iterative-improve</span> good-enough? improve)
  (<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">iterative-improve-inner</span> guess)
    (<span style="color: #b9ca4a;">if</span> (good-enough? guess) guess
        (iterative-improve-inner (improve guess))))
  (<span style="color: #b9ca4a;">lambda</span> (x) (iterative-improve-inner x)))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">sqrt</span> x)
  ((iterative-improve (<span style="color: #b9ca4a;">lambda</span> (guess)
                        (&lt; (abs (- (square guess) x)) 0.001))
                      (<span style="color: #b9ca4a;">lambda</span> (guess)
                        (average guess (/ x guess))))
   1.0))
</pre>
</div>

<div style="text-align: center;">
<a href="./posts.html">←</a>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Please, send me an <a href="mailto:giulio.pietroiusti@gmail.com">email</a> if you have any comment.</p> <p>Created with <span class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)</span></p>
</div>
</body>
</html>
